Revit 2027 API
PrintParameters.OriginOffsetX Property
 The User defined X value of offset from left bottom corner. Unit is feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OriginOffsetX { get; set; }
Public Property OriginOffsetX As Double
	Get
	Set
public:
property double OriginOffsetX {
	double get ();
	void set (double value);
}
member OriginOffsetX : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if PaperPlacement is not Margins and MarginType is not User defined type.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace